#+TITLE: Git CheatSheet
#+AUTHOR: Joshua Branson

* recovering dangling commits

Sometimes it is possible to create a commit w/o putting that commit on a branch.

You can see these dangling commits with

#+BEGIN_SRC sh :results output :exports both
git fsck
#+END_SRC

#+RESULTS:
: dangling blob 28b3db8d657b0bf9b5d1eecc1b55fe6fd0535a50
: dangling blob 68329d103af2cfc59874d6355137e3e28f388a47
: dangling blob 6f3d64581e4a5f1d602a26ce4446cc417e65e835
: dangling blob a67fc356b723c40c9704f66bb91d197723d0d7dc

If you see "dangling commit", then you have found a dangling commit that is NOT merged with your head.

~git checkout HASH~ will switch HEAD to that commit.  You can then merge HEAD with master.  OR you can create a new branch and merge master to that branch.
